---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.CableTrayConduitRunBase
source: html/eb8abc97-c3ff-8cf6-b981-403526f87261.htm
---
# CableTrayConduitRunBase Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.